class Fly::Categorizer < Categorizer
  SCHEDULE = {
    67  => 3, # Платья
    112 => 3, # Платья повседневные
    72  => 3, # Платья вечерние
    71  => 5, # Туники
    73  => 5, # Блузки женские
    115 => 5, # Блузки повседневные
    116 => 5, # Блузки офисные
    76  => 5, # Свитшоты
    77  => 8, # Юбки
    117 => 8, # Юбки повседневные
    118 => 8, # Юбки офисные
    80  => 7, # Брюки женские
    121 => 7, # Брюки повседневные
    122 => 7, # Брюки классические
    81  => 2, # Жакеты
    119 => 2, # Жакеты повседневные
    120 => 2, # Жакеты элегантные
    123 => 5, # Джемперы вязаные
    124 => 5, # Кардиганы вязаные
    125 => 3, # Платья вязаные
    126 => 5, # Туники вязаные
    127 => 2, # Жилеты вязаные
    128 => 8, # Юбки вязаные
    129 => 15, # Аксессуары
    131 => 11, # Сумки
    130 => 15, # Очки
    86  => 15, # Ремни
    113 => 3, # Платья элегантные
    114 => 3, # Платья коктейльные
    109 => 2, # Верхняя одежда
    110 => 2, # Пальто
    111 => 2  # Тренчи
  }
end
